#+TITLE: Calendar and Material
#+AUTHOR:
#+DATE: <2020-08-30 Sun>
#+INCLUDE: _navigation-l0.org
#+STARTUP: showall

The course runs from Sep, 14, 2020 till Dec 15, 2020 with the
following schedule:

- Mondays, 14:30-16:00
- Tuesdays, 9:00-10:30

The Zoom link for the video conference available on the Moodle
platform at the University of Trento.

#+BEGIN_warning
Interactive sessions are recorded and made available on the Internet
for reference and support to other students.  If you do not wish to be
recorded, you can organize a meeting with one of the professors.
#+END_warning

You might want to read the [[file:./instructions.org][Instructions]] to understand how to take the
course.  (And the expression "you might want ..." gets translated in
Italian with: "è assolutamente necessario che ...".)

Notice also the titles and structure of the lessons yet to be
delivered might change slightly .  The rule of the thumb is: if there
are links with materials, things won't change; if there are no links
to the materials, titles and content are just suggestions.

#+begin_src ruby :exports results :results html output :var lesson_plan = lesson-plan
      def content_to_string content_type, content
        if content_type == "Q&A"
           "Q&A about lessons #{content}."
        elsif content_type == "Prepare"
           "Students prepare L#{content}"
        else
           content
        end
      end

      def link_if file, name, options = {}
        (file and File.exists?(file)) ? "<a href=\"#{file}\" #{"download" if options[:download]}>#{name}</a>" : name
      end

      def lesson_to_materials lesson_number, materials
        mats = materials.select { |x| lesson_number == x[:lesson] and x[:topic_number] != "Z" and x[:topic_number] != "ZX" }
        mats.map { |x|
          "#{x[:basename]} (#{link_if(x[:video], "VIDEO")}) (#{link_if(x[:pdf], "PDF")})"
        }.join("<br/>\n")
      end

      def zoom_lesson_to_materials lesson_number, materials
        mats = materials.select { |x| lesson_number == x[:lesson] and (x[:topic_number] == "Z" or x[:topic_number] == "ZX") }
        mats.map { |x|
          "#{x[:basename]} (#{link_if(x[:video], "VIDEO")}) (#{link_if(x[:pdf], "PDF")})"
        }.join("<br/>\n")
      end

      # take a filename in the "material" directory and break it into its basic components
      # (the most important of which being the lesson number)
      def filename_to_elements filename
        elements = File.basename(filename).split "."

        hash = {}
        hash[:pdf] = filename
        hash[:basename] = File.basename filename, ".pdf"

        if File.exists?(filename.gsub(".pdf", "-small.mp4"))
          hash[:video] = filename.gsub(".pdf", "-small.mp4")
        elsif File.exists?(filename.gsub(".pdf", "-small.mkv"))
          hash[:video] = filename.gsub(".pdf", "-small.mkv")
        end

        hash[:lesson] = elements[0][1..-1].to_i
        hash[:topic_number] = elements[1]
        hash[:group] = elements[2]
        hash[:topic] = elements[3].gsub("-small", "")
        hash[:extension] = elements[4]

        hash
      end

      # take a basename in the "material" directory and break it into its basic
      # components (the most important of which being the lesson number)
      def basename_to_elements basename
        elements = File.basename(basename).split "."

        hash = {}

        hash[:basename] = File.basename(basename)

        if File.exists?("#{basename}.pdf") 
          hash[:pdf] = "#{basename}.pdf"
        end

        if File.exists?("#{basename}-small.mp4")
          hash[:video] = "#{basename}-small.mp4"
        end

        if File.exists?("#{basename}-small.mkv")
          hash[:video] = "#{basename}-small.mkv"
        end

        hash[:lesson] = elements[0][1..-1].to_i
        hash[:topic_number] = elements[1]
        hash[:group] = elements[2]
        hash[:topic] = elements[3].gsub("-small", "")
        hash[:extension] = elements[4]

        hash
      end

      template = <<-EOS
      <table class="calendar">
        <thead>
          <tr>
            <th>Date</th>
            <th>Starts at</th>
            <th>Material to prepare</th>
            <th>Content of lesson</th>
            <th>Lesson Recording</th>
          </tr>
        </thead>
        <tbody>
          <% lesson_plan.each do |slot| %>
          <tr>
          <td class="date">
            <%= DateTime.parse(slot[0]).strftime("%a") %><br />
            <%= DateTime.parse(slot[0]).strftime("%d/%b/%Y") %>
          </td>
          <td class="time"><%= DateTime.parse(slot[0]).strftime("%H:%M") %></td>
          <td class="material">
            <%= lesson_to_materials slot[3], materials %>
          </td>
          <td class="content">
            <%= content_to_string slot[4], slot[5] %>
          </td>
          <td class="content">
            <% if slot[6] != "" %>
              <%= zoom_lesson_to_materials slot[6], materials %>
            <% end %>
            <% if slot[7] != "" %>
            <a href="<%= slot[7] %>">Lesson Recording</a>
            <% end %>
          </td>
          </tr>
          <% end %>
        </tbody>
      </table>
      EOS

        require 'csv'
        require 'erb'

        # the materials to upload could be pdf and videos (mp4, mkv)
        # in some cases there are only pdf, in order only videos.
        #
        # the only thing we are sure of, is that files related to the same lesson
        # are named in the same way:
        #
        #  LNTN.Topic.Content-small.{mp4,mkv,pdf}
        # 
        # We therefore get the common part and then add the extensions as needed in
        # the basename_to_elements function
        # 
        files = Dir.glob("./material/*{.pdf,-small.mp4,-small.mkv}").map { |x| x.gsub(".pdf", "").gsub("-small.mp4", "").gsub("-small.mkv", "") }.uniq.sort
        materials = files.map { |x| basename_to_elements x }

        renderer = ERB.new(template, nil, "-")
        output = renderer.result(binding)

        # for debugging
        # puts pdf_files
        # puts materials

        puts output

#+end_src

#+RESULTS:
#+begin_export html
<table class="calendar">
  <thead>
    <tr>
      <th>Date</th>
      <th>Starts at</th>
      <th>Material to prepare</th>
      <th>Content of lesson</th>
      <th>Lesson Recording</th>
    </tr>
  </thead>
  <tbody>
    
    <tr>
    <td class="date">
      Mon<br />
      14/Sep/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L1.T11.Introduction.Modeling (<a href="./material/L1.T11.Introduction.Modeling-small.mp4" >VIDEO</a>) (<a href="./material/L1.T11.Introduction.Modeling.pdf" >PDF</a>)
    </td>
    <td class="content">
      Rules and Resources
    </td>
    <td class="content">
      
      
      <a href="https://drive.google.com/file/d/1Fe-tCom7R2Eo_otUfXX5AUP2e_Cxte9-/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      15/Sep/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L2.T12.Introduction.Language (<a href="./material/L2.T12.Introduction.Language-small.mp4" >VIDEO</a>) (<a href="./material/L2.T12.Introduction.Language.pdf" >PDF</a>)<br/>
./material/L2.T13.Introduction.LogicalModeling (<a href="./material/L2.T13.Introduction.LogicalModeling-small.mp4" >VIDEO</a>) (<a href="./material/L2.T13.Introduction.LogicalModeling.pdf" >PDF</a>)<br/>
./material/L2.T14.Introduction.WhyLogic (<a href="./material/L2.T14.Introduction.WhyLogic-small.mp4" >VIDEO</a>) (<a href="./material/L2.T14.Introduction.WhyLogic.pdf" >PDF</a>)<br/>
./material/L2.X.1.Introduction.ExerciseOnModels (<a href="./material/L2.X.1.Introduction.ExerciseOnModels-small.mkv" >VIDEO</a>) (<a href="./material/L2.X.1.Introduction.ExerciseOnModels.pdf" >PDF</a>)
    </td>
    <td class="content">
      Students prepare L2
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      21/Sep/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      
    </td>
    <td class="content">
      
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      22/Sep/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L3.T21.SetTheory.Introduction (<a href="./material/L3.T21.SetTheory.Introduction-small.mp4" >VIDEO</a>) (<a href="./material/L3.T21.SetTheory.Introduction.pdf" >PDF</a>)<br/>
./material/L3.T22.SetTheory.BasicNotions (<a href="./material/L3.T22.SetTheory.BasicNotions-small.mp4" >VIDEO</a>) (<a href="./material/L3.T22.SetTheory.BasicNotions.pdf" >PDF</a>)<br/>
./material/L3.T23.SetTheory.Relations (<a href="./material/L3.T23.SetTheory.Relations-small.mp4" >VIDEO</a>) (<a href="./material/L3.T23.SetTheory.Relations.pdf" >PDF</a>)<br/>
./material/L3.T24.SetTheory.Functions (<a href="./material/L3.T24.SetTheory.Functions-small.mp4" >VIDEO</a>) (<a href="./material/L3.T24.SetTheory.Functions.pdf" >PDF</a>)<br/>
./material/L3.T31.PL.Intuition (<a href="./material/L3.T31.PL.Intuition-small.mp4" >VIDEO</a>) (<a href="./material/L3.T31.PL.Intuition.pdf" >PDF</a>)<br/>
./material/L3.T32.PL.Language (<a href="./material/L3.T32.PL.Language-small.mp4" >VIDEO</a>) (<a href="./material/L3.T32.PL.Language.pdf" >PDF</a>)<br/>
./material/L3.X.1B.Introduction.ExerciseOnModels (VIDEO) (<a href="./material/L3.X.1B.Introduction.ExerciseOnModels.pdf" >PDF</a>)<br/>
./material/L3.X.25A.SetTheory.Exercises (<a href="./material/L3.X.25A.SetTheory.Exercises-small.mkv" >VIDEO</a>) (<a href="./material/L3.X.25A.SetTheory.Exercises.pdf" >PDF</a>)<br/>
./material/L3.X.25B.SetTheory.Exercises (<a href="./material/L3.X.25B.SetTheory.Exercises-small.mp4" >VIDEO</a>) (<a href="./material/L3.X.25B.SetTheory.Exercises.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 1, 2, 3.
    </td>
    <td class="content">
      
      
      <a href="https://drive.google.com/file/d/1rW4NY75IJP3zVFd6TsJrzxeySVLhUV6T/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      28/Sep/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L4.T33.PL.Satisfiability (<a href="./material/L4.T33.PL.Satisfiability-small.mp4" >VIDEO</a>) (<a href="./material/L4.T33.PL.Satisfiability.pdf" >PDF</a>)<br/>
./material/L4.T34.PL.Validity.Unsat (<a href="./material/L4.T34.PL.Validity.Unsat-small.mp4" >VIDEO</a>) (<a href="./material/L4.T34.PL.Validity.Unsat.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 2, 3, 4.
    </td>
    <td class="content">
      
      
      <a href="https://drive.google.com/file/d/1-abjdix7esi7t0_Ucz0F2tNplBpVx9B8/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      29/Sep/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L5.T35.PL.LogCE (<a href="./material/L5.T35.PL.LogCE-small.mp4" >VIDEO</a>) (<a href="./material/L5.T35.PL.LogCE.pdf" >PDF</a>)<br/>
./material/L5.T35.PL.LogCE-Addendum (VIDEO) (<a href="./material/L5.T35.PL.LogCE-Addendum.pdf" >PDF</a>)<br/>
./material/L5.T36.PL.theories (<a href="./material/L5.T36.PL.theories-small.mp4" >VIDEO</a>) (<a href="./material/L5.T36.PL.theories.pdf" >PDF</a>)<br/>
./material/L5.T41.PL.Reasoning.TruthTables.Summary (<a href="./material/L5.T41.PL.Reasoning.TruthTables.Summary-small.mp4" >VIDEO</a>) (<a href="./material/L5.T41.PL.Reasoning.TruthTables.Summary.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 3, 4, 5.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      05/Oct/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L6.T42.PL.Reasoning.TruthTables.DecisionProblems (<a href="./material/L6.T42.PL.Reasoning.TruthTables.DecisionProblems-small.mp4" >VIDEO</a>) (<a href="./material/L6.T42.PL.Reasoning.TruthTables.DecisionProblems.pdf" >PDF</a>)<br/>
./material/L6.T43.PL.Reasoning.TruthTables.SATCNF (<a href="./material/L6.T43.PL.Reasoning.TruthTables.SATCNF-small.mp4" >VIDEO</a>) (<a href="./material/L6.T43.PL.Reasoning.TruthTables.SATCNF.pdf" >PDF</a>)<br/>
./material/L6.T44.PL.Reasoning.TruthTables.SATDPLL (<a href="./material/L6.T44.PL.Reasoning.TruthTables.SATDPLL-small.mp4" >VIDEO</a>) (<a href="./material/L6.T44.PL.Reasoning.TruthTables.SATDPLL.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 4, 5, 6.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      06/Oct/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L7.T51.PL.Reasoning.Deduction (<a href="./material/L7.T51.PL.Reasoning.Deduction-small.mp4" >VIDEO</a>) (<a href="./material/L7.T51.PL.Reasoning.Deduction.pdf" >PDF</a>)<br/>
./material/L7.T52.PL.Reasoning.Hilbert.calculus (<a href="./material/L7.T52.PL.Reasoning.Hilbert.calculus-small.mp4" >VIDEO</a>) (<a href="./material/L7.T52.PL.Reasoning.Hilbert.calculus.pdf" >PDF</a>)<br/>
./material/L7.T53.PL.Reasoning.Tableau (<a href="./material/L7.T53.PL.Reasoning.Tableau-small.mp4" >VIDEO</a>) (<a href="./material/L7.T53.PL.Reasoning.Tableau.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 5, 6, 7.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      12/Oct/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L8.X.1.PL.Exercises (<a href="./material/L8.X.1.PL.Exercises-small.mp4" >VIDEO</a>) (<a href="./material/L8.X.1.PL.Exercises.pdf" >PDF</a>)<br/>
./material/L8.X.1.PL.Exercises-Addenda (VIDEO) (<a href="./material/L8.X.1.PL.Exercises-Addenda.pdf" >PDF</a>)<br/>
./material/L8.X.25C.SetTheory.Solutions (<a href="./material/L8.X.25C.SetTheory.Solutions-small.mp4" >VIDEO</a>) (<a href="./material/L8.X.25C.SetTheory.Solutions.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 6, 7, 8.
    </td>
    <td class="content">
      
      
      <a href="https://drive.google.com/file/d/1e0Na5yL8uCTUfRUqWRFkOrbL80a9V0-6/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      13/Oct/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L9.T71.FOL.Intuition (<a href="./material/L9.T71.FOL.Intuition-small.mp4" >VIDEO</a>) (<a href="./material/L9.T71.FOL.Intuition.pdf" >PDF</a>)<br/>
./material/L9.T72.FOL.Language (<a href="./material/L9.T72.FOL.Language-small.mp4" >VIDEO</a>) (<a href="./material/L9.T72.FOL.Language.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 7, 8, 9.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      19/Oct/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L10.T73.FOL.Interpretation.function (<a href="./material/L10.T73.FOL.Interpretation.function-small.mp4" >VIDEO</a>) (<a href="./material/L10.T73.FOL.Interpretation.function.pdf" >PDF</a>)<br/>
./material/L10.T74.FOL.SAT.wrt.assignment (<a href="./material/L10.T74.FOL.SAT.wrt.assignment-small.mp4" >VIDEO</a>) (<a href="./material/L10.T74.FOL.SAT.wrt.assignment.pdf" >PDF</a>)<br/>
./material/L10.T75.FOL.SAT2LE (<a href="./material/L10.T75.FOL.SAT2LE-small.mp4" >VIDEO</a>) (<a href="./material/L10.T75.FOL.SAT2LE.pdf" >PDF</a>)<br/>
./material/L10.T76.FOL.exercises (<a href="./material/L10.T76.FOL.exercises-small.mp4" >VIDEO</a>) (<a href="./material/L10.T76.FOL.exercises.pdf" >PDF</a>)<br/>
./material/L10.T77.FOL.Finite.Domains (<a href="./material/L10.T77.FOL.Finite.Domains-small.mp4" >VIDEO</a>) (<a href="./material/L10.T77.FOL.Finite.Domains.pdf" >PDF</a>)<br/>
./material/L10.T78.FOL.FOL.wrt.DB (<a href="./material/L10.T78.FOL.FOL.wrt.DB-small.mp4" >VIDEO</a>) (<a href="./material/L10.T78.FOL.FOL.wrt.DB.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 8, 9, 10.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      20/Oct/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L11.T81.FOL.Reasoning.Hilbert.calculus (<a href="./material/L11.T81.FOL.Reasoning.Hilbert.calculus-small.mp4" >VIDEO</a>) (<a href="./material/L11.T81.FOL.Reasoning.Hilbert.calculus.pdf" >PDF</a>)<br/>
./material/L11.T82.FOL.Reasoning.Tableau (<a href="./material/L11.T82.FOL.Reasoning.Tableau-small.mp4" >VIDEO</a>) (<a href="./material/L11.T82.FOL.Reasoning.Tableau.pdf" >PDF</a>)<br/>
./material/L11.T83.FOL.Reasoning.Tableau.corr.compl (<a href="./material/L11.T83.FOL.Reasoning.Tableau.corr.compl-small.mp4" >VIDEO</a>) (<a href="./material/L11.T83.FOL.Reasoning.Tableau.corr.compl.pdf" >PDF</a>)<br/>
./material/L11.T84.FOL.Reasoning.Tableau.examples (<a href="./material/L11.T84.FOL.Reasoning.Tableau.examples-small.mp4" >VIDEO</a>) (<a href="./material/L11.T84.FOL.Reasoning.Tableau.examples.pdf" >PDF</a>)<br/>
./material/L11.T85.FOL.Reasoning.Tableau.termination (<a href="./material/L11.T85.FOL.Reasoning.Tableau.termination-small.mp4" >VIDEO</a>) (<a href="./material/L11.T85.FOL.Reasoning.Tableau.termination.pdf" >PDF</a>)<br/>
./material/L11.T86.FOL.Reasoning.Tableau.countermodels (<a href="./material/L11.T86.FOL.Reasoning.Tableau.countermodels-small.mp4" >VIDEO</a>) (<a href="./material/L11.T86.FOL.Reasoning.Tableau.countermodels.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 9, 10, 11.
    </td>
    <td class="content">
      
        ./material/L10.Z.Lezione.Frontale (VIDEO) (<a href="./material/L10.Z.Lezione.Frontale.pdf" >PDF</a>)<br/>
./material/L10.ZX.Lezione.Frontale (<a href="./material/L10.ZX.Lezione.Frontale-small.mp4" >VIDEO</a>) (<a href="./material/L10.ZX.Lezione.Frontale.pdf" >PDF</a>)
      
      
      <a href="https://drive.google.com/file/d/1YPnlzb9BZLRtkMbJdTqFgx07adxo4TUN/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      26/Oct/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L12.X.FOL.Exercises (<a href="./material/L12.X.FOL.Exercises-small.mp4" >VIDEO</a>) (<a href="./material/L12.X.FOL.Exercises.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 10, 11, 12.
    </td>
    <td class="content">
      
        ./material/L11.Z.Lezione.Frontale (VIDEO) (<a href="./material/L11.Z.Lezione.Frontale.pdf" >PDF</a>)
      
      
      <a href="https://drive.google.com/file/d/1-DHZgOk3s3JHvyIndytZFMvnrzpq3rOL/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Fri<br />
      06/Nov/2020
    </td>
    <td class="time">10:00</td>
    <td class="material">
      
    </td>
    <td class="content">
      Mid-term
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      09/Nov/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L13.T101.ML.Intuition (<a href="./material/L13.T101.ML.Intuition-small.mp4" >VIDEO</a>) (<a href="./material/L13.T101.ML.Intuition.pdf" >PDF</a>)<br/>
./material/L13.T102.ML.language (<a href="./material/L13.T102.ML.language-small.mp4" >VIDEO</a>) (<a href="./material/L13.T102.ML.language.pdf" >PDF</a>)<br/>
./material/L13.T103.ML.SAT (<a href="./material/L13.T103.ML.SAT-small.mp4" >VIDEO</a>) (<a href="./material/L13.T103.ML.SAT.pdf" >PDF</a>)<br/>
./material/L13.T104.ML.VAL2LE (<a href="./material/L13.T104.ML.VAL2LE-small.mp4" >VIDEO</a>) (<a href="./material/L13.T104.ML.VAL2LE.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 11, 12, 13.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      10/Nov/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L14.T111.ML-K.More.ModalK (<a href="./material/L14.T111.ML-K.More.ModalK-small.mp4" >VIDEO</a>) (<a href="./material/L14.T111.ML-K.More.ModalK.pdf" >PDF</a>)<br/>
./material/L14.T112.ML-K.More.Acces.relation (<a href="./material/L14.T112.ML-K.More.Acces.relation-small.mp4" >VIDEO</a>) (<a href="./material/L14.T112.ML-K.More.Acces.relation.pdf" >PDF</a>)<br/>
./material/L14.T113.ML-K.More.ModalKT (<a href="./material/L14.T113.ML-K.More.ModalKT-small.mp4" >VIDEO</a>) (<a href="./material/L14.T113.ML-K.More.ModalKT.pdf" >PDF</a>)<br/>
./material/L14.T114.ML-K.More.ModalKB (<a href="./material/L14.T114.ML-K.More.ModalKB-small.mp4" >VIDEO</a>) (<a href="./material/L14.T114.ML-K.More.ModalKB.pdf" >PDF</a>)<br/>
./material/L14.T115.ML-K.More.ModalKD (<a href="./material/L14.T115.ML-K.More.ModalKD-small.mp4" >VIDEO</a>) (<a href="./material/L14.T115.ML-K.More.ModalKD.pdf" >PDF</a>)<br/>
./material/L14.T116.ML-K.More.ModalKT4 (<a href="./material/L14.T116.ML-K.More.ModalKT4-small.mp4" >VIDEO</a>) (<a href="./material/L14.T116.ML-K.More.ModalKT4.pdf" >PDF</a>)<br/>
./material/L14.T117.ML-K.More.ModalKT5 (<a href="./material/L14.T117.ML-K.More.ModalKT5-small.mp4" >VIDEO</a>) (<a href="./material/L14.T117.ML-K.More.ModalKT5.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 12, 13, 14.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      16/Nov/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L15.T118.ML-K.More.MML (<a href="./material/L15.T118.ML-K.More.MML-small.mp4" >VIDEO</a>) (<a href="./material/L15.T118.ML-K.More.MML.pdf" >PDF</a>)<br/>
./material/L15.T119.ML-K.More.MMLKB (<a href="./material/L15.T119.ML-K.More.MMLKB-small.mp4" >VIDEO</a>) (<a href="./material/L15.T119.ML-K.More.MMLKB.pdf" >PDF</a>)<br/>
./material/L15.T121.Reasoning.Tableau (<a href="./material/L15.T121.Reasoning.Tableau-small.mp4" >VIDEO</a>) (<a href="./material/L15.T121.Reasoning.Tableau.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 13, 14, 15.
    </td>
    <td class="content">
      
      
      <a href="https://drive.google.com/file/d/1B_3brNVb1N9le1oHsYWjtA8JzEXFA1Ev/view?usp=sharing">Lesson Recording</a>
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      17/Nov/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      
    </td>
    <td class="content">
      Q&A about lessons 14, 15, 16.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      23/Nov/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L17.T141.DL.Introduction.Intuition (<a href="./material/L17.T141.DL.Introduction.Intuition-small.mp4" >VIDEO</a>) (<a href="./material/L17.T141.DL.Introduction.Intuition.pdf" >PDF</a>)<br/>
./material/L17.T142.DL.Introduction.2KG (<a href="./material/L17.T142.DL.Introduction.2KG-small.mp4" >VIDEO</a>) (<a href="./material/L17.T142.DL.Introduction.2KG.pdf" >PDF</a>)<br/>
./material/L17.T143.DL.Introduction.DL (<a href="./material/L17.T143.DL.Introduction.DL-small.mp4" >VIDEO</a>) (<a href="./material/L17.T143.DL.Introduction.DL.pdf" >PDF</a>)<br/>
./material/L17.X.ML.Informal2Formal (<a href="./material/L17.X.ML.Informal2Formal-small.mp4" >VIDEO</a>) (<a href="./material/L17.X.ML.Informal2Formal.pdf" >PDF</a>)<br/>
./material/L17.X2.ML.Frames (<a href="./material/L17.X2.ML.Frames-small.mp4" >VIDEO</a>) (<a href="./material/L17.X2.ML.Frames.pdf" >PDF</a>)<br/>
./material/L17.X3.ML.Validity (<a href="./material/L17.X3.ML.Validity-small.mp4" >VIDEO</a>) (<a href="./material/L17.X3.ML.Validity.pdf" >PDF</a>)<br/>
./material/L17.X4.ML.ValidityII (<a href="./material/L17.X4.ML.ValidityII-small.mp4" >VIDEO</a>) (<a href="./material/L17.X4.ML.ValidityII.pdf" >PDF</a>)<br/>
./material/L17.X5.ML.ValidityIII (<a href="./material/L17.X5.ML.ValidityIII-small.mp4" >VIDEO</a>) (<a href="./material/L17.X5.ML.ValidityIII.pdf" >PDF</a>)<br/>
./material/L17.X6.ML.MoreFrames (<a href="./material/L17.X6.ML.MoreFrames-small.mp4" >VIDEO</a>) (<a href="./material/L17.X6.ML.MoreFrames.pdf" >PDF</a>)<br/>
./material/L17.X7.ML.Tableaux (<a href="./material/L17.X7.ML.Tableaux-small.mp4" >VIDEO</a>) (<a href="./material/L17.X7.ML.Tableaux.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 15, 16, 17.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      24/Nov/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L18.T151-2.DL.TBox-ABox.TBox.synt.sem (<a href="./material/L18.T151-2.DL.TBox-ABox.TBox.synt.sem-small.mp4" >VIDEO</a>) (<a href="./material/L18.T151-2.DL.TBox-ABox.TBox.synt.sem.pdf" >PDF</a>)<br/>
./material/L18.T153.DL.TBox-ABox.Terminology (<a href="./material/L18.T153.DL.TBox-ABox.Terminology-small.mp4" >VIDEO</a>) (<a href="./material/L18.T153.DL.TBox-ABox.Terminology.pdf" >PDF</a>)<br/>
./material/L18.T154.DL.TBox-ABox.TBox.reasoning (<a href="./material/L18.T154.DL.TBox-ABox.TBox.reasoning-small.mp4" >VIDEO</a>) (<a href="./material/L18.T154.DL.TBox-ABox.TBox.reasoning.pdf" >PDF</a>)<br/>
./material/L18.T155.DL.TBox-ABox.ABox.synt.sem (<a href="./material/L18.T155.DL.TBox-ABox.ABox.synt.sem-small.mp4" >VIDEO</a>) (<a href="./material/L18.T155.DL.TBox-ABox.ABox.synt.sem.pdf" >PDF</a>)<br/>
./material/L18.T156.DL.TBox-ABox.ABox.reasoning (<a href="./material/L18.T156.DL.TBox-ABox.ABox.reasoning-small.mp4" >VIDEO</a>) (<a href="./material/L18.T156.DL.TBox-ABox.ABox.reasoning.pdf" >PDF</a>)<br/>
./material/L18.T157.DL.TBox-ABox.CWA (<a href="./material/L18.T157.DL.TBox-ABox.CWA-small.mp4" >VIDEO</a>) (<a href="./material/L18.T157.DL.TBox-ABox.CWA.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 16, 17, 18.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      30/Nov/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      ./material/L19.T161.DL.Tableaux.Reasoning.Intuition (<a href="./material/L19.T161.DL.Tableaux.Reasoning.Intuition-small.mp4" >VIDEO</a>) (<a href="./material/L19.T161.DL.Tableaux.Reasoning.Intuition.pdf" >PDF</a>)<br/>
./material/L19.T163.DL.Tableaux.Reasoning (<a href="./material/L19.T163.DL.Tableaux.Reasoning-small.mp4" >VIDEO</a>) (<a href="./material/L19.T163.DL.Tableaux.Reasoning.pdf" >PDF</a>)<br/>
./material/L19.T164.X.DL.Tableaux.Reasoning.TBox-examples (<a href="./material/L19.T164.X.DL.Tableaux.Reasoning.TBox-examples-small.mp4" >VIDEO</a>) (<a href="./material/L19.T164.X.DL.Tableaux.Reasoning.TBox-examples.pdf" >PDF</a>)<br/>
./material/L19.T165.X.DL.Tableaux.Reasoning.ABox-examples (<a href="./material/L19.T165.X.DL.Tableaux.Reasoning.ABox-examples-small.mp4" >VIDEO</a>) (<a href="./material/L19.T165.X.DL.Tableaux.Reasoning.ABox-examples.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 17, 18, 19.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      01/Dec/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      ./material/L20.T171.X.DL.Applications.DB (<a href="./material/L20.T171.X.DL.Applications.DB-small.mp4" >VIDEO</a>) (<a href="./material/L20.T171.X.DL.Applications.DB.pdf" >PDF</a>)<br/>
./material/L20.T172.X.DL.Applications.ERModels (<a href="./material/L20.T172.X.DL.Applications.ERModels-small.mp4" >VIDEO</a>) (<a href="./material/L20.T172.X.DL.Applications.ERModels.pdf" >PDF</a>)<br/>
./material/L20.T173.X.DL.Applications.KG (<a href="./material/L20.T173.X.DL.Applications.KG-small.mp4" >VIDEO</a>) (<a href="./material/L20.T173.X.DL.Applications.KG.pdf" >PDF</a>)
    </td>
    <td class="content">
      Q&A about lessons 18, 19, 20.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      07/Dec/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      
    </td>
    <td class="content">
      Q&A about lessons 19, 20, 21.
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      08/Dec/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      
    </td>
    <td class="content">
      
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Mon<br />
      14/Dec/2020
    </td>
    <td class="time">14:30</td>
    <td class="material">
      
    </td>
    <td class="content">
      Q&A about final term
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
    <tr>
    <td class="date">
      Tue<br />
      15/Dec/2020
    </td>
    <td class="time">09:00</td>
    <td class="material">
      
    </td>
    <td class="content">
      Final term
    </td>
    <td class="content">
      
      
    </td>
    </tr>
    
  </tbody>
</table>
#+end_export


** Code to build material.csv                                      :noexport:

#+begin_src ruby :exports none :results silent
require 'csv'
files = Dir.glob "/home/adolfo/Slides/*.ppt*"
header = [ ["basename", "topic_no", "subtopic_no", "topic", "subtopic"] ]
content = files.map { |x| m = /L([0-9]+)\.T([0-9]+)\.([^\.]+)\.([^\.]+)/.match(x); [ File.basename(x), m[1].to_i, m[2].to_i, m[3], m[4] ] }
array = header + content

CSV.open("a.csv", "wb") do |csv|
  array.each do |row|
    csv << row
  end
end
#+end_src

** Input Table for Calendar                                        :noexport:

There is no way of specifying that a table cannot be exported.  Hence
I moved the table here, under a heading which is not exported.

#+name: lesson-plan
| date             | week | slot | prepare | content_type     | content              | Pdf? | recording                                                                          |   |
|------------------+------+------+---------+------------------+----------------------+------+------------------------------------------------------------------------------------+---|
| 2020-09-14T14:30 |    1 |    1 |       1 | Instructions     | Rules and Resources  |      | https://drive.google.com/file/d/1Fe-tCom7R2Eo_otUfXX5AUP2e_Cxte9-/view?usp=sharing |   |
| 2020-09-15T09:00 |    1 |    2 |       2 | Prepare          | 2                    |      |                                                                                    |   |
| 2020-09-21T14:30 |    2 |    3 |         | Lesson suspended |                      |      |                                                                                    |   |
| 2020-09-22T09:00 |    2 |    4 |       3 | Q&A              | 1, 2, 3              |      | https://drive.google.com/file/d/1rW4NY75IJP3zVFd6TsJrzxeySVLhUV6T/view?usp=sharing |   |
| 2020-09-28T14:30 |    3 |    5 |       4 | Q&A              | 2, 3, 4              |      | https://drive.google.com/file/d/1-abjdix7esi7t0_Ucz0F2tNplBpVx9B8/view?usp=sharing |   |
| 2020-09-29T09:00 |    3 |    6 |       5 | Q&A              | 3, 4, 5              |      |                                                                                    |   |
| 2020-10-05T14:30 |    4 |    7 |       6 | Q&A              | 4, 5, 6              |      |                                                                                    |   |
| 2020-10-06T09:00 |    4 |    8 |       7 | Q&A              | 5, 6, 7              |      |                                                                                    |   |
| 2020-10-12T14:30 |    5 |    9 |       8 | Q&A              | 6, 7, 8              |      | https://drive.google.com/file/d/1e0Na5yL8uCTUfRUqWRFkOrbL80a9V0-6/view?usp=sharing |   |
| 2020-10-13T09:00 |    5 |   10 |       9 | Q&A              | 7, 8, 9              |      |                                                                                    |   |
| 2020-10-19T14:30 |    6 |   11 |      10 | Q&A              | 8, 9, 10             |      |                                                                                    |   |
| 2020-10-20T09:00 |    6 |   12 |      11 | Q&A              | 9, 10, 11            |   10 | https://drive.google.com/file/d/1YPnlzb9BZLRtkMbJdTqFgx07adxo4TUN/view?usp=sharing |   |
| 2020-10-26T14:30 |    7 |   13 |      12 | Q&A              | 10, 11, 12           |   11 | https://drive.google.com/file/d/1-DHZgOk3s3JHvyIndytZFMvnrzpq3rOL/view?usp=sharing |   |
| 2020-11-06T10:00 |    8 |   15 |         | Exam             | Mid-term             |      |                                                                                    |   |
| 2020-11-09T14:30 |    9 |   17 |      13 | Q&A              | 11, 12, 13           |      |                                                                                    |   |
| 2020-11-10T09:00 |    9 |   18 |      14 | Q&A              | 12, 13, 14           |      |                                                                                    |   |
| 2020-11-16T14:30 |   10 |   19 |      15 | Q&A              | 13, 14, 15           |      | https://drive.google.com/file/d/1B_3brNVb1N9le1oHsYWjtA8JzEXFA1Ev/view?usp=sharing |   |
| 2020-11-17T09:00 |   10 |   20 |      16 | Q&A              | 14, 15, 16           |      |                                                                                    |   |
| 2020-11-23T14:30 |   11 |   21 |      17 | Q&A              | 15, 16, 17           |      |                                                                                    |   |
| 2020-11-24T09:00 |   11 |   22 |      18 | Q&A              | 16, 17, 18           |      |                                                                                    |   |
| 2020-11-30T14:30 |   12 |   23 |      19 | Q&A              | 17, 18, 19           |      |                                                                                    |   |
| 2020-12-01T09:00 |   12 |   24 |      20 | Q&A              | 18, 19, 20           |      |                                                                                    |   |
| 2020-12-07T14:30 |   13 |   25 |      21 | Q&A              | 19, 20, 21           |      | https://drive.google.com/file/d/1s47j2ihAfJz5403vBpnKIvTtH7rI1NS9/view?usp=sharing |   |
| 2020-12-08T09:00 |   13 |   26 |         |                  |                      |      |                                                                                    |   |
| 2020-12-14T14:30 |   14 |   27 |         | General Q&A      | Q&A about final term |      |                                                                                    |   |
| 2020-12-15T09:00 |   14 |   28 |         | Exam             | Final term           |      |                                                                                    |   |


** Local Variables                                                 :noexport:

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
